Кинотеатр/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>EnumRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Фильм</name>
    <type>
      <types>CatalogRef.Фильмы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

Кинотеатр/src/Enums/ВидыНоменклатуры/ВидыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыНоменклатуры</name>
  <enumValues>
    <name>Билет</name>
  </enumValues>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
</mdclass:Enum>

Кинотеатр/src/Catalogs/Номенклатура/Forms/ФормаЭлемента/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ФильмПриИзменении(Элемент)
	
	Наименование = СформироватьНаименование(Объект.Фильм);
	Объект.Наименование = Наименование;
	Объект.ПолноеНаименование = Наименование;
	
КонецПроцедуры


&НаКлиенте
Процедура ВидНоменклатурыПриИзменении(Элемент)
	
	Наименование = СформироватьНаименование(Объект.Фильм);
	Объект.Наименование = Наименование;
	Объект.ПолноеНаименование = Наименование;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СформироватьНаименование(Фильм)
	
	СтрокаВозврат = "";
	
	Результат = Новый Массив();
	
	Если ЗначениеЗаполнено(Объект.Фильм)
		И Объект.ВидНоменклатуры = ПредопределенноеЗначение("Перечисление.ВидыНоменклатуры.Билет") Тогда
		
		Результат.Добавить(НСтр("ru = 'Билет на'"));
		Результат.Добавить(Объект.Фильм);
		
		СтрокаВозврат = СтрСоединить(Результат, " ");
		
	КонецЕсли;
	
	Возврат СтрокаВозврат;
	
КонецФункции

#КонецОбласти
